org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** Hugo                                                                        :hugo:
:PROPERTIES:
:EXPORT_FILE_NAME: hugo
:END:

Some curated list of bookmarks related to ~hugo~.

*** Themes

- [[https://themes.gohugo.io/hermit/][hermit]]
  - https://www.petersheim.net
    - first time this theme was seen
  - https://nicke.io/
    - dark version
  - https://nayak.io/
    - light version
  - https://jimmysong.io/
    - clean white
  - https://leaanthony.com/
    - clean white, navigation bar at the top
  - https://linuxwind.com/
    - another clean white version
  - https://milad.dev
    - clean blog structure
    - also check his [[https://milad.dev/books][books list]]
  - https://daryl.wakatara.com
    - really nice posts about [[https://daryl.wakatara.com/tags/gtd/][productivity]], [[https://daryl.wakatara.com/tags/emacs/][emacs]] and interesting [[https://daryl.wakatara.com/tags/books/][book]] recommendations
- [[https://prose.yihui.org/][Hugo Prose]]
- [[https://tract-docs.dev/en/][Tract]]
  - Good for documentation
- [[https://themes.gohugo.io/hugo-theme-pure/][Hugo Theme Pure]]
  - Also has Tocbot
- [[https://bella.cc/blog/][bella.bc]]
  - Customization of ER theme with Zettels.
- [[https://github.com/mpaluchowski/hugo-well-traveled][hugo-well-travelled]]
  - for travelling

*** Searching

- [[https://www.josephearl.co.uk/post/static-sites-search-hugo/][Easily add search using lunr.js]]
- [[https://sentamal.in/articles/static-site-search-with-lunrjs/][Static site search using lunr.js]]
- [[https://www.forsure.dev/-/2019/09/03/add-search-functionality-to-your-hugo-static-site/][Add search functionality to your hugo static site]]
- [[https://halfelf.org/2017/hugos-making-json/][Generate index JSON]]
- [[https://halfelf.org/2017/hugos-lunr-search/][Generate the Lunr.JS search]]
- Themes that implement search
  - [[https://github.com/vjeantet/hugo-theme-docdock][hugo-theme-dockdock]]

*** [[https://discourse.gohugo.io/t/easy-full-hugo-simple-online-shop-with-just-netlify-stripe/27960/6][Easy "Full Hugo" simple online shop with just Netlify + Stripe]]
:PROPERTIES:
:TIMESTAMP: <2021-03-02 Tue>
:END:
k
