content/bookmarks/hugo.md
+++
title = "Hugo"
author = ["Victor Dorneanu"]
lastmod = 2021-03-11T09:32:02+01:00
tags = ["bookmark", "hugo"]
draft = false
weight = 2002
toc = true
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
+++

Some curated list of bookmarks related to `hugo`.


## Themes {#themes}

-   [hermit](https://themes.gohugo.io/hermit/)
    -   <https://www.petersheim.net>
        -   first time this theme was seen
    -   <https://nicke.io/>
        -   dark version
    -   <https://nayak.io/>
        -   light version
    -   <https://jimmysong.io/>
        -   clean white
    -   <https://leaanthony.com/>
        -   clean white, navigation bar at the top
    -   <https://linuxwind.com/>
        -   another clean white version
    -   <https://milad.dev>
        -   clean blog structure
        -   also check his [books list](https://milad.dev/books)
    -   <https://daryl.wakatara.com>
        -   really nice posts about [productivity](https://daryl.wakatara.com/tags/gtd/), [emacs](https://daryl.wakatara.com/tags/emacs/) and interesting [book](https://daryl.wakatara.com/tags/books/) recommendations
-   [Hugo Prose](https://prose.yihui.org/)
-   [Tract](https://tract-docs.dev/en/)
    -   Good for documentation
-   [Hugo Theme Pure](https://themes.gohugo.io/hugo-theme-pure/)
    -   Also has Tocbot
-   [bella.bc](https://bella.cc/blog/)
    -   Customization of ER theme with Zettels.


## Searching {#searching}

-   [Easily add search using lunr.js](https://www.josephearl.co.uk/post/static-sites-search-hugo/)
-   [Static site search using lunr.js](https://sentamal.in/articles/static-site-search-with-lunrjs/)
-   [Add search functionality to your hugo static site](https://www.forsure.dev/-/2019/09/03/add-search-functionality-to-your-hugo-static-site/)
-   [Generate index JSON](https://halfelf.org/2017/hugos-making-json/)
-   [Generate the Lunr.JS search](https://halfelf.org/2017/hugos-lunr-search/)
-   Themes that implement search
    -   [hugo-theme-dockdock](https://github.com/vjeantet/hugo-theme-docdock)


## [Easy "Full Hugo" simple online shop with just Netlify + Stripe](https://discourse.gohugo.io/t/easy-full-hugo-simple-online-shop-with-just-netlify-stripe/27960/6) {#easy-full-hugo-simple-online-shop-with-just-netlify-plus-stripe}

k
